## 🏗️ Terraform Plan Results

### 🧪 Staging Environment
❌ Plan not available or job was skipped

### 🚀 Production Environment
<details><summary>Show Production Plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "brazilsouth"
      + name     = "rg-sachat-prod"
      + tags     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "SA Chat"
          + "Repository"  = "legendschat-infrastructure"
        }
    }

  # module.backup.azurerm_backup_container_storage_account.main[0] will be created
  + resource "azurerm_backup_container_storage_account" "main" {
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-sachat-production"
      + resource_group_name = "rg-sachat-prod"
      + storage_account_id  = (known after apply)
    }

  # module.backup.azurerm_backup_policy_file_share.main will be created
  + resource "azurerm_backup_policy_file_share" "main" {
      + id                  = (known after apply)
      + name                = "backup-policy-sachat-production"
      + recovery_vault_name = "rsv-sachat-production"
      + resource_group_name = "rg-sachat-prod"
      + timezone            = "UTC"

      + backup {
          + frequency = "Daily"
          + time      = "02:00"
        }

      + retention_daily {
          + count = 30
        }

      + retention_monthly {
          + count             = 12
          + include_last_days = false
          + weekdays          = [
              + "Sunday",
            ]
          + weeks             = [
              + "First",
            ]
        }

      + retention_weekly {
          + count    = 12
          + weekdays = [
              + "Sunday",
            ]
        }
    }

  # module.backup.azurerm_recovery_services_vault.main will be created
  + resource "azurerm_recovery_services_vault" "main" {
      + cross_region_restore_enabled  = false
      + id                            = (known after apply)
      + immutability                  = (known after apply)
      + location                      = "brazilsouth"
      + name                          = "rsv-sachat-production"
      + public_network_access_enabled = true
      + resource_group_name           = "rg-sachat-prod"
      + sku                           = "Standard"
      + soft_delete_enabled           = true
      + storage_mode_type             = "GeoRedundant"
      + tags                          = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "SA Chat"
          + "Repository"  = "legendschat-infrastructure"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.container_apps.azurerm_container_app.main will be created
  + resource "azurerm_container_app" "main" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-sachat-production"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-sachat-prod"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "SA Chat"
          + "Repository"  = "legendschat-infrastructure"
        }

      + ingress {
          + allow_insecure_connections = false
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 3080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas                     = 10
          + min_replicas                     = 2
          + revision_suffix                  = (known after apply)
          + termination_grace_period_seconds = 0

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/techacademialendaria/legendschat:latest"
              + memory            = "2Gi"
              + name              = "librechat"

              + env {
                  + name  = "HOST"
                  + value = "0.0.0.0"
                }
              + env {
                  + name  = "NODE_ENV"
                  + value = "production"
                }
              + env {
                  + name        = "MONGO_URI"
                  + secret_name = "mongodb-connection-string"
                }
              + env {
                  + name  = "AZURE_STORAGE_ACCOUNT_NAME"
                  + value = (known after apply)
                }
              + env {
                  + name        = "AZURE_STORAGE_ACCOUNT_KEY"
                  + secret_name = "storage-account-key"
                }
              + env {
                  + name        = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  + secret_name = "application-insights-key"
                }
              + env {
                  + name  = "FILE_STRATEGY"
                  + value = "azure"
                }
              + env {
                  + name  = "MEILI_HOST"
                  + value = "http://localhost:7700"
                }
              + env {
                  + name  = "RAG_API_URL"
                  + value = "http://localhost:8000"
                }
              + env {
                  + name  = "AZURE_CONTAINER_NAME"
                  + value = "files"
                }
              + env {
                  + name  = "AZURE_STORAGE_PUBLIC_ACCESS"
                  + value = "false"
                }
            }
          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "getmeili/meilisearch:v1.12.3"
              + memory            = "1Gi"
              + name              = "meilisearch"

              + env {
                  + name  = "MEILI_HOST"
                  + value = "http://localhost:7700"
                }
              + env {
                  + name  = "MEILI_NO_ANALYTICS"
                  + value = "true"
                }

              + volume_mounts {
                  + name = "meili-data"
                  + path = "/meili_data"
                }
            }
          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/danny-avila/librechat-rag-api-dev-lite:latest"
              + memory            = "1Gi"
              + name              = "rag-api"

              + env {
                  + name  = "RAG_PORT"
                  + value = "8000"
                }
            }

          + volume {
        ```
</details>

---
*Pusher: @techacademialendaria, Action: `pull_request`*